[
    {
    "name": "The new Website is finally live!", 
    "date": "2024-06-28", 
    "picture": "../IMG/08.01 - shadow_nachi_fb.png",
    "content":"Heyya! It's Finnaly time to showcase what I have been working on since my original site has been pretty quiet <br> My old site was pretty much pure HTML ins the sense of design so I wanted to try myself out with this one! <br> Another thing I wanna integrate later on is Cookies(For example switching the site and having it not load you into the Home tab every time X3) <br><br> Sooo with that out of the way I hope to write some more personal blogs here for you guys to enjoy so <br> Thank you for reading <br> Stay safe <br><br> Nachi the Protogen"
    },
    {
        "name": "Something is missing",
        "date": "2024-06-30",
        "picture": "../IMG/31.03_-_shadow_nachi_duohbsticker_transp_new.png",
        "content": "So this one is more recent, but I really need to talk about this somewhere, so why not my own blog? <br>So sadly, my Partner of 2,5 Months broke up with me. The reason was sadly out of either of our control, since he was just missing the feelings. <br>It was unfortunate, but it was a very healthy relationship for me and him, and I hope I can move on from this soon.<br> I kind of also wanted to make this so I could lead people to a place where I talk about it, so I could just distract myself from the whole thing. <br>And when I am ready, I hope I can get my best friend back since that was the role he had for me before all this.<br> And I still trust him more than anyone else, so keeping my hopes up that my feelings pass rather sooner than later. :P<br> <br>Anyhow, that is mostly all I want to talk about today otherwise, I am developing a game in my college that should be done soon nothing big,<br> just a small wave shooter in a historic setting. <br>Alright, that's it from me! <br> This shoutout goes out to my friend Microwave, who listened to me write this blog <br>I love you all.<br> ~Nachi the Protogen~"
    }
]