[
    {
    "name": "The new Website is finally live!", 
    "date": "2024-06-28", 
    "picture": "../IMG/08.01 - shadow_nachi_fb.png",
    "content":"Heyya! It's Finnaly time to showcase what I have been working on since my original site has been pretty quiet <br> My old site was pretty much pure HTML ins the sense of design so I wanted to try myself out with this one! <br> Another thing I wanna integrate later on is Cookies(For example switching the site and having it not load you into the Home tab every time X3) <br><br> Sooo with that out of the way I hope to write some more personal blogs here for you guys to enjoy so <br> Thank you for reading <br> Stay safe <br><br> Nachi the Protogen"
    },
    {
        "name": "Something is missing",
        "date": "2024-06-30",
        "picture": "../IMG/31.03_-_shadow_nachi_duohbsticker_transp_new.png",
        "content": "So this one is more recent, but I really need to talk about this somewhere, so why not my own blog? <br>So sadly, my Partner of 2,5 Months broke up with me. The reason was sadly out of either of our control, since he was just missing the feelings. <br>It was unfortunate, but it was a very healthy relationship for me and him, and I hope I can move on from this soon.<br> I kind of also wanted to make this so I could lead people to a place where I talk about it, so I could just distract myself from the whole thing. <br>And when I am ready, I hope I can get my best friend back since that was the role he had for me before all this.<br> And I still trust him more than anyone else, so keeping my hopes up that my feelings pass rather sooner than later. :P<br> <br>Anyhow, that is mostly all I want to talk about today otherwise, I am developing a game in my college that should be done soon nothing big,<br> just a small wave shooter in a historic setting. <br>Alright, that's it from me! <br> This shoutout goes out to my friend Microwave, who listened to me write this blog <br>I love you all.<br> ~Nachi the Protogen~"
    },{
        "name": "Healing After a Breakup",
        "date": "2024-08-23",
        "picture" : "../IMG/myOwn/Nachi vent art.png",
        "content": "I wanted to take a moment to reflect on the last couple of months, which have been some of the hardest in my life. The breakup I went through left me dealing with emotions that I wasn’t prepared for, and I’ve been trying to process everything ever since. It’s been a mix of highs and lows, and I’ve come to realize that while our relationship had a lot of good moments, the way things ended left me with some emotional wounds.<br><br>The breakup itself happened because of what was described as a 'lack of feelings,' and even though I respect that honesty, it was really hard to hear. For a while, I believed things would work out, and that made the eventual end even more difficult. I found myself dealing with attachment issues and a lot of anxiety as I tried to make sense of what had happened.<br><br>Looking back, I realize that things started to shift when he became part of a new friend group. I’m not saying it was anyone’s fault, but from my perspective, it felt like I was being replaced or that his priorities had changed. It’s tough to understand everything that was happening on his side, but I can only speak to how it made me feel, which was pretty broken.<br><br>After the breakup, we tried to stay friends. I think both of us had good intentions, but it ended up being more painful than I expected. The trauma I was carrying made it hard to move on and be just friends, and I struggled with that balance. Unfortunately, things got complicated when I tried to find support from a mutual friend. I talked a lot about what I was going through, and that ended up straining those friendships, too.<br><br>I don’t want to place blame or dwell on the negative. Our relationship had a lot of positive moments, and I’m grateful for those. But breakups can bring up a lot of difficult emotions, and for me, it triggered some trauma that I’m still working through. I’m hoping to find healing by focusing on new passions, new people, and finding peace within myself. It’s been a draining journey, but I’m ready to keep moving forward.<br><br>Much love,<br>Nachi"
    },{
        "name": "I thought you were a friend",
        "date": "2024-08-26",
        "picture": "../IMG/myOwn/nachi ded.png",
        "content": "Heya folks. Gona make a short one about what just happened because I just got blocked by a friend I will call Blue for this post because that's a name that could semi-describe them. Basically I wrote a blog post a few days ago, and it was a very rough emotional rollercoaster. I laid down that, I mean, this is my website. I can do whatever I want, so I just wrote about my emotions. After that my ex friend blue just decided 'that blog was pretty bad' and yea it kinda was since it's not like I put much thought into it it was a vent right? So anyway I was very insistent that I would keep it cause it's my feelings on my fucking website until he used abuser tactics like insulting me and my self worth trying to make me take it down going as far as gaslighting me into believing that that vent is what keeps me stuck giving which wow. Anyhow I called him out for it and told him if he want to learn more he can discuss it and he just blocked me. I also wanna ad that I did indeed rewrite my blog to be more civil, but idk if I will do something like that with this one. Very much sad because I bonded with that guy a lot and I mean I don't want anything to go that way, but I will keep my morning for someone who shows no empathy or respect towards me to a minimum so idk if you will read this blue, maybe someone else will tell you but I won't block you the same way and I'm open to talk. People might see this as a personal attack but honestly, after what just happened who would blame me? So just a quick story I found funny and kinda sad.<br> Seeya'll later (or not :p) <br><br>Nachi the Artist Proot now!"
    }
]
