[
    {
    "name": "The new Website is finally live!", 
    "date": "2024-06-28", 
    "picture": "../IMG/08.01 - shadow_nachi_fb.png",
    "content":"Heyya! It's Finnaly time to showcase what I have been working on since my original site has been pretty quiet <br> My old site was pretty much pure HTML ins the sense of design so I wanted to try myself out with this one! <br> Another thing I wanna integrate later on is Cookies(For example switching the site and having it not load you into the Home tab every time X3) <br><br> Sooo with that out of the way I hope to write some more personal blogs here for you guys to enjoy so <br> Thank you for reading <br> Stay safe <br><br> Nachi the Protogen"
    },
    {
        "name": "Something is missing",
        "date": "2024-06-30",
        "picture": "../IMG/31.03_-_shadow_nachi_duohbsticker_transp_new.png",
        "content": "So this one is more recent, but I really need to talk about this somewhere, so why not my own blog? <br>So sadly, my Partner of 2,5 Months broke up with me. The reason was sadly out of either of our control, since he was just missing the feelings. <br>It was unfortunate, but it was a very healthy relationship for me and him, and I hope I can move on from this soon.<br> I kind of also wanted to make this so I could lead people to a place where I talk about it, so I could just distract myself from the whole thing. <br>And when I am ready, I hope I can get my best friend back since that was the role he had for me before all this.<br> And I still trust him more than anyone else, so keeping my hopes up that my feelings pass rather sooner than later. :P<br> <br>Anyhow, that is mostly all I want to talk about today otherwise, I am developing a game in my college that should be done soon nothing big,<br> just a small wave shooter in a historic setting. <br>Alright, that's it from me! <br> This shoutout goes out to my friend Microwave, who listened to me write this blog <br>I love you all.<br> ~Nachi the Protogen~"
    },{
        "name": "Breakup, tears and trauma",
        "date": "2024-08-22",
        "picture" : "",
        "content": "Okay, I haven't been on this blog in a while so this is gona be a long one folks. The last 2 months were the worst months of my life due to a breakup and from what I got told by professionals that it seems like I now carry a trauma from it. From mood swings to suicidal thoughts, it was pretty much all there, a horrific time that makes me ask if us dating was even worth it. To go in deeper the entire breakup itself was caused to a from my understanding "lack of feelings" and this simply broke me for a week before we even broke up basically gave me attachment issues since I was lead on to believe that everything would be fine. But a thing I noticed was that the real disinterest in me was observable ever since he got his new friend group. Without the knowledge of what's happening on his side it just made me believe that I was replaced. With or without intention it just broke me further and then an incident happened apparently in that group that made me feel like that's the most likely conclusion I can draw from it. With that as any young ex couple would we tried to stay friends but due to that trauma I felt like it was impossible for me to try it cause it never ended well when we tried. Just so that I get tolled that the way I tried to find help with a mutual friend of mine was something that rubbed him the wrong way. For context due to the attachment issues I got from him I talked with that mutual friend a lot about our breakup. So much in fact that he sometimes needed a break from me. So that was apparently so bad that he didn't want to have anything to do with me anymore and as much as I wanted to end the friendship anyway that just felt like a nippicky slap in the face coming from someone where I had to show way more acceptance for past actions he took. Overall, our relationship was great but the breakup after left me in trauma, tears and lost for what's next. This vent comes from the desire to finally lose what I kept piling up in me for the last 2 months and I just can't anymore. I hope I can focus on new passions, new people and just something else. I'm so drained from this emotional rollercoaster, I just want to be done with it. <br>Much Love<br> Nachi"}
]
