[
    {
      "Chapter": "Origin",
      "ID": "chapter0",
      "content": "<div class=\"card\">\n<h1 class=\"title\">Origin</h1>\n<p class=\"text\">Meet Nachi, a gray and green Protogen with green holographic wings, a Batch symbol >_ on his visor, and green hair tips on his head and tail.</p>\n<p class=\"text\">Raised by humans on Earth, he spent 15 years with his \"Family,\" being treated and educated well. But he always had a desire to explore the world.</p>\n<p class=\"text\">It is in his programming to learn, but considering his unknown alien origin, letting him out would be a massive risk that his family didn't want to take.</p>\n<p class=\"text\">So celebrating his 15 years with his family (unknown to him that it is his 18th birthday), he decided to go out on his own to find out about the world.</p>\n<p class=\"text\">His plan to break out of the place he called home was set. So he went out into a rainy night, something he could only ever observe from windows and media.</p>\n<p class=\"text\">His fascination for it was obvious; not even a drop scared him, and this moment manifested what his journey would hold for him.</p>\n<br> <br>\n</div>"
    },
    {
      "Chapter": "Chapter 1 | Hello New World",
      "ID": "chapter1target",
      "content": "<div class=\"card\">\n<h1 class=\"title\" id=\"chapter1target\">Chapter 1 | Hello New World</h1> <br>\n<p class=\"text\">Raindrops slide down his wings as he observes his surroundings. What he was looking at was a big city filled with life and vibrant lights.</p>\n<p class=\"text\">No one noticed Nachi's unique design since everyone was too busy with their own life to notice him. </p>\n<p class=\"text\">So he ventured on seemingly directionless into the City center from there on he had a bunch of directions he could go to.</p>\n<p class=\"text\">On his way to the City center, he noticed an event that was going on. On the other side of the street, multiple people were running into an alleyway.</p>\n<p class=\"text\">Odded out by this unusual scenery his curiosity got the better of him so he started to follow them. The alleyway was very dark, so dark in fact that Nachi was the only thing illuminating it.</p>\n<p class=\"text\">At the end of the alleyway, he found some sort of entrance into the canals of the city. After arguing with himself Nachi went out and explored the canals.</p>\n<p class=\"text\">After about a kilometer of walking, he found a big room under the city filled with people living in shelters and very small houses.</p>\n<p class=\"text\">He stumbled over a hidden underground community maybe he could find answers about his origins here? Those were the first thoughts entering Nachi's mind before he had to introduce himself.</p>\n<p class=\"text\">The people here were not as blind to his unusual look then the others and while he was trying to find his way around he noticed a lot of looks and whispers coming his way.</p>\n<p class=\"text\">\"Hey you\" He heard from the distance. </p>\n<p class=\"text\">\"You don't look like you're from around here\". The person in question is a human with short brown hair and an armless top, their expression was a curious one.</p>\n<p class=\"text\">\"How do you know?\" Nachi asked while already knowing the answer. </p>\n<p class=\"text\">\"Look at yourself, you're not human. You are a Protogen!\"</p>\n<p class=\"text\">\"A what now?\" He asked in confusion.</p>\n<p class=\"text\">\"A Protogen! You are one of those fluffy people with the visors. But I never quite saw one like you.\"</p>\n<p class=\"text\">Nachi was overwhelmed at the moment. He is a Protogen known to be fluffy People with visors like his.</p>\n<p class=\"text\">\"Well, where are my manners my name is Kudo and what are you called?\" He asked in a very polite tone.</p>\n<p class=\"text\">\"Nachi... my Name is Nachi. I lived with my Family here for 15 Years.\" Nachi's expression was an overwhelmed one and it was pretty noticeable.</p>\n<p class=\"text\">\"Is everything alright with you Nachi?\" He laid his hand on Nachi's shoulder, a gesture he was not familiar with.</p>\n<p class=\"text\">\"I'm fine, I have never really been 'Outside' before.\"</p>\n<p class=\"text\">\"That's okay, we will get you up to speed soon enough\" He laid his arm around Nachi's shoulder and walked with him through this underground community.</p>\n<br> <br>\n</div>"
    },
    {
      "Chapter": "Chapter 2 | Integration",
      "ID": "chapter2target",
      "content": "<div class=\"card\">\n<h1 class=\"title\" id=\"chapter2target\">Chapter 2 | Integration</h1> <br>\n<p class=\"text\">Nachi follows Kudo closely, he is in wonder about everything he sees from shelters to living spaces on scaffolding.</p>\n<p class=\"text\">\"What is this place called?\" - Nachi asked out of his curiosity.</p>\n<p class=\"text\">\"We call it 'Fortuna' or at least we do; no one else knows this place besides the people that live here.\" Kudo seems passionate about this place.</p>\n<p class=\"text\">Maybe he grew up here; those were Nachi's first thoughts. After a short walk, they arrived at a big shelter, covered with rugs and planes, genuinely way bigger than most of the living spaces here.</p>\n<p class=\"text\">\"We found one\" - Kudo screamed into the big building. Do they already expect a Protogen? \"Come in\" - Came from the inside.</p>\n<p class=\"text\">Kudo pushed one of the rugs out of the way, and they both went inside. The atmosphere was like nothing else. Everything was lit up by cozy lights, and the entire floor was filled with carpets.</p>\n<p class=\"text\">Considering how big this shelter is, there were only 2 people here. One seemed like an elder, and the other looked like one of those people that he followed in here.</p>\n<p class=\"text\">\"Look at you; I never thought I would see another one of your race ever again\" - the elderly woman said; her hair was tied together, and she was wearing some sort of poncho.</p>\n<p class=\"text\">\"It's... uh a pleasure to be here?\" Nachi wasn't in many social situations; he barely knew what to say without it coming across the wrong way. </p>\n<p class=\"text\">\"You seem... confused; how did you get here in the first place?\"</p>\n<p class=\"text\">Nachi took a seat on the long carpet to explain what happened, and Kudo sat down next to him.</p>\n<p class=\"text\">After a long session of explaining where Nachi was raised and how he got to Fortuna, there were still a few unanswered questions. Like where he came from or why he looks way older than 15.</p>\n<p class=\"text\">\"Well, you had a long way getting here; wouldn't you like to take a rest?\" </p>\n<p class=\"text\">\"I would appreciate that... yeah\" Nachi had been going through a lot that day, and the fact they offered him a place to rest was very overwhelming for him at first.</p>\n<p class=\"text\">When Kudo shows Nachi his place to sleep, he is surprised to find it is an elevated carpet used as a hammock.</p>\n<p class=\"text\">\"If you need anything, then just tell me! I am one room next to you!\" Kudo said. </p>\n<p class=\"text\">Nachi was still extremely wet from the rain, so his priority was to dry himself and collect what he learned. He figured out what his species was called and that he was in a place called Fortuna.</p>\n<p class=\"text\">After drying himself up by rolling on the rugs on the floor, he laid himself in his makeshift bed. He thought of what he could do tomorrow or if he would figure out where he came from.</p>\n<p class=\"text\">His mind was running the entire night; he also thought about his family. \"Do they miss me?\" \"Are they worried?\" All of these thoughts held up until the next morning when Kudo woke him up by pulling his tail.</p>\n<p class=\"text\">\"What the hell was that for?!\" Said Nachi with a raised voice</p>\n<p class=\"text\">\"Hey, you act as if everyone has a tail here,\" Kudo said shrugging his silly action off not knowing how it affected Nachi</p>\n<p class=\"text\">\"Jerk\"</p>\n<p class=\"text\">\"Now, come on, I will show you around the market area; maybe you can help out somewhere\" - Kudo left the room, giving Nachi time to get himself ready.</p>\n<p class=\"text\">After a few minutes, they both walked outside into the vibrant underground. What felt dark and cold last night felt way warmer and cozier this morning. People from all sorts of places gathered here.</p>\n<p class=\"text\">Nachi was astonished by how this place lived its life; for him, it felt so mysterious, but he felt comfortable. There were humans, furries, and other creatures here. Some had some similarities to his own looks but were quite different.</p>\n<p class=\"text\">\"So this is what you would call the market area; some sort of bazaar?\"</p>\n<p class=\"text\">\"Yes, that is a fitting term; this place has everything, people sell what they don't need or repair things. Some even make new stuff out of old stuff.\" Kudo was walking alongside Nachi, showing him all these things.</p>\n<p class=\"text\">\"So... Why did you even come to me when I arrived here?\"</p>\n<p class=\"text\">\"Curiosity... and you were sticking out like a sore thumb. Those LED Wings, not many here can afford that.\"</p>\n<p class=\"text\">\"Fair point\" Nachi was trying to blend in as much as possible, but he had no idea how to do that, considering his upbringing.</p>\n<p class=\"text\">\"Hey, maybe you could help me today with organizing the shelter. We need more free hands since new people arrived.\" Kudo proposed. </p>\n<p class=\"text\">Nachi seemed very happy to help out; after all, those people gave him a place to stay and food.</p>\n<p class=\"text\">After hours of helping out in the shelter, they both were taking a break. \nWhile they were talking about what could come next, a loud explosion occurred, and parts of the ceiling came crashing down, nearly hitting Kudo and Nachi.</p>\n<p class=\"text\">\"We have to go!\" Kudo screamed, getting up from the ground</p>\n<p class=\"text\">Nachi already could hear footsteps and screams coming their way, seemingly in a panic.</p>\n<p class=\"text\">Kudo pushed Nachi to move, and they both were running through the underground. The explosion was caused by intruders finding out about this place.</p>\n<p class=\"text\">Those were not officials or police; those people were heavily armed and looked like mercenaries. A firefight started between the people living here and those mercs.</p>\n<p class=\"text\">Nachi was scared of what was happening, but he needed to act. He pulled Kudo's arm to lead him into one of the side passages. </p>\n<p class=\"text\">\"I need to get you out of here!\" Nachi was anxious about the situation, and Kudo nodded; they didn't have many options left.</p>\n<p class=\"text\">They kept running as more mercenaries started to fire at them; one of the bullets hit Nachi in the leg. \"Aghh!\" Nachi grunted in pain; he had to limp while Kudo was supporting him. </p>\n<p class=\"text\">Nachi's visor started to show errors and warnings; the bullet must have caused severe damage to his systems.</p>\n<p class=\"text\">After an exhausting chase, they managed to get out of Fortuna; the pain in Nachi's leg was unbearable, but they had to move away from the scene. They found refuge in a small hidden alleyway.</p>\n<p class=\"text\">Nachi collapsed from the pain and exhaustion, leaving Kudo to watch over him. They were now fugitives from their own home. This was just the beginning of their journey together.</p>\n</div>"
    },
    {
      "Chapter": "Chapter 3 | Adaptation",
      "ID": "chapter3target",
      "content": "<div class=\"card\">\n<h1 class=\"title\" id=\"chapter3target\">Chapter 3 | Adaptation</h1> <br>\n<p class=\"text\">Nachi wakes up in a small hidden alleyway, Kudo still watching over him. The pain in his leg is excruciating, but he tries to push through it.</p>\n<p class=\"text\">\"We can't stay here for long,\" Kudo says, worry evident in his voice.</p>\n<p class=\"text\">Nachi nods, trying to stand up, but the pain makes him stumble. Kudo helps him up, and they start moving again, careful not to attract any attention.</p>\n<p class=\"text\">They find a small clinic on the outskirts of the city. The doctor, a kind-hearted older man, agrees to treat Nachi's wound without asking too many questions.</p>\n<p class=\"text\">\"This will take some time to heal,\" the doctor says after removing the bullet and bandaging the wound. \"You should stay here for a few days.\"</p>\n<p class=\"text\">Kudo thanks the doctor profusely, and they settle into a small room in the back of the clinic. Nachi spends most of his time resting, while Kudo keeps watch and gathers supplies.</p>\n<p class=\"text\">During this time, Nachi learns more about the world outside his family home. Kudo tells him about the different species and cultures, the dangers and the beauty of it all.</p>\n<p class=\"text\">Nachi listens intently, his curiosity growing with each story. He starts to feel a sense of purpose, a desire to explore and understand this world he was kept from for so long.</p>\n<p class=\"text\">As the days pass, Nachi's leg slowly heals. He practices walking, first with a limp, then more steadily. Kudo helps him, offering encouragement and support.</p>\n<p class=\"text\">Finally, the day comes when Nachi feels strong enough to continue their journey. They thank the doctor and leave the clinic, ready to face whatever challenges lie ahead.</p>\n<p class=\"text\">Their bond grows stronger as they travel together, facing obstacles and discovering new places. Nachi begins to adapt to this new life, finding joy in the freedom and the adventure.</p>\n<p class=\"text\">He still thinks of his family, wondering if they are searching for him, if they miss him. But for now, he focuses on the present, on the journey with Kudo, and the new experiences that await them.</p>\n<br> <br>\n</div>"
    },
    {
      "Chapter": "Chapter 4 | New Allies",
      "ID": "chapter4target",
      "content": "<div class=\"card\">\n<h1 class=\"title\" id=\"chapter4target\">Chapter 4 | New Allies</h1> <br>\n<p class=\"text\">As Nachi and Kudo continue their journey, they come across a group of travelers who are also on the run. They are a diverse group, each with their own story and reasons for being fugitives.</p>\n<p class=\"text\">The leader of the group, a tall and imposing figure named Zane, approaches Nachi and Kudo with a proposition.</p>\n<p class=\"text\">\"We could use some extra hands,\" Zane says. \"And you two look like you could use some allies.\"</p>\n<p class=\"text\">Nachi and Kudo exchange glances. They are wary of strangers, but they also know the value of strength in numbers.</p>\n<p class=\"text\">\"We could use some help too,\" Kudo admits. \"But how do we know we can trust you?\"</p>\n<p class=\"text\">Zane smiles, a surprisingly warm expression for such a tough-looking individual. \"Trust is earned,\" he says. \"But we all want the same thing: to survive.\"</p>\n<p class=\"text\">After some discussion, they decide to join forces. The group welcomes them, and Nachi and Kudo quickly integrate into the new dynamic.</p>\n<p class=\"text\">Nachi finds himself bonding with a young mechanic named Lyra. She is fascinated by his Protogen nature and asks him endless questions about his design and capabilities.</p>\n<p class=\"text\">\"You're like a living piece of art,\" she says, examining his holographic wings. \"I bet you have some amazing stories.\"</p>\n<p class=\"text\">Nachi chuckles, still getting used to the attention. \"I guess you could say that.\"</p>\n<p class=\"text\">Kudo, meanwhile, forms a close friendship with a former soldier named Rhea. They share combat tips and strategies, preparing for any potential threats they might face.</p>\n<p class=\"text\">Together, the group faces numerous challenges: bandits, harsh weather, and the constant threat of being discovered by those who hunt them.</p>\n<p class=\"text\">But through it all, they grow stronger. They learn to rely on each other, to trust and support one another.</p>\n<p class=\"text\">Nachi begins to feel a sense of belonging, something he hadn't felt since leaving his family. He realizes that this group, with all its quirks and differences, is becoming a new kind of family for him.</p>\n<p class=\"text\">Their journey is far from over, but with new allies by their side, Nachi and Kudo feel more hopeful than ever about the future.</p>\n<br> <br>\n</div>"
    },
    {
      "Chapter": "Chapter 5 | The Hidden City",
      "ID": "chapter5target",
      "content": "<div class=\"card\">\n<h1 class=\"title\" id=\"chapter5target\">Chapter 5 | The Hidden City</h1> <br>\n<p class=\"text\">The group hears rumors of a hidden city, a place where fugitives and outcasts can live in peace, away from the prying eyes of the authorities.</p>\n<p class=\"text\">Determined to find this sanctuary, they set off on a difficult and dangerous journey. The path is fraught with peril, but they push through, driven by the hope of a safe haven.</p>\n<p class=\"text\">After weeks of travel, they finally reach their destination. The hidden city is a marvel, built into the side of a mountain and accessible only through a series of intricate tunnels.</p>\n<p class=\"text\">The city is a bustling hub of activity, filled with people from all walks of life. It is a place of refuge and freedom, where everyone is accepted regardless of their past.</p>\n<p class=\"text\">Nachi is in awe of the place. It is unlike anything he has ever seen. The city's advanced technology and harmonious blend of cultures fascinate him.</p>\n<p class=\"text\">The group is welcomed warmly by the city's leaders. They are given a place to stay and time to rest and recover from their arduous journey.</p>\n<p class=\"text\">Nachi spends his days exploring the city, learning about its history and the people who call it home. He meets other Protogens, each with their own unique stories and experiences.</p>\n<p class=\"text\">He also finds a mentor in a wise old Protogen named Arin. Arin teaches Nachi about his species' history and helps him understand his own abilities and potential.</p>\n<p class=\"text\">Kudo, meanwhile, finds work as a guard, using his skills to help protect the city from potential threats. He feels a sense of purpose and fulfillment in his new role.</p>\n<p class=\"text\">As the days turn into weeks, Nachi and Kudo begin to feel at home in the hidden city. They make new friends and build a new life for themselves.</p>\n<p class=\"text\">But they know that their journey is not over. There are still many questions left unanswered, and they are determined to uncover the truth about Nachi's origins and the forces that threaten their new home.</p>\n<p class=\"text\">With renewed strength and a sense of belonging, they prepare for the challenges that lie ahead, ready to face whatever comes their way.</p>\n<br> <br>\n</div>"
    },
    {
      "Chapter": "Chapter 6 | Revelation",
      "ID": "chapter6target",
      "content": "<div class=\"card\">\n<h1 class=\"title\" id=\"chapter6target\">Chapter 6 | Revelation</h1> <br>\n<p class=\"text\">Nachi's time in the hidden city brings many revelations. Arin, his mentor, reveals a startling truth about Nachi's origins.</p>\n<p class=\"text\">\"You were created for a purpose,\" Arin says one evening as they sit in the city's grand library. \"A purpose that even you might not fully understand yet.\"</p>\n<p class=\"text\">Nachi listens intently, his curiosity piqued. Arin explains that Protogens were designed with advanced technology and unique capabilities for a reason, though much of their history has been lost or hidden.</p>\n<p class=\"text\">\"There are those who fear us, who see our potential as a threat,\" Arin continues. \"That is why you were hidden away, raised among humans. To protect you from those who would seek to control or destroy you.\"</p>\n<p class=\"text\">Nachi feels a mix of emotions: confusion, anger, and a deep sense of purpose. He realizes that his journey is about more than just finding his place in the world. It's about understanding who he is and what he was meant to do.</p>\n<p class=\"text\">With Arin's guidance, Nachi begins to unlock more of his abilities. He learns to harness his holographic wings, to use them not just for decoration, but for flight and defense.</p>\n<p class=\"text\">He also starts to understand the deeper connection he has with technology, how he can interface with systems and machines in ways that others cannot.</p>\n<p class=\"text\">Kudo stands by his side, offering support and encouragement. Their bond grows stronger, forged by the challenges they have faced and the trust they have built.</p>\n<p class=\"text\">But as Nachi delves deeper into his past and his abilities, he attracts attention. Those who fear the Protogens, who seek to control their power, begin to close in on the hidden city.</p>\n<p class=\"text\">One night, the city is attacked. The invaders are ruthless, determined to capture or destroy the Protogens they find.</p>\n<p class=\"text\">Nachi and Kudo fight valiantly to protect their new home, but they are vastly outnumbered. Arin is captured, and Nachi is forced to make a difficult decision.</p>\n<p class=\"text\">\"You must go,\" Arin says as he is dragged away. \"Find the others, uncover the truth, and fulfill your purpose.\"</p>\n<p class=\"text\">With a heavy heart, Nachi flees the city with Kudo. They vow to return, to save their friends and their home. But first, they must find the other Protogens, uncover the secrets of their past, and prepare for the battles that lie ahead.</p>\n<p class=\"text\">Their journey continues, filled with new challenges and new allies. And through it all, Nachi holds onto the hope that one day he will understand his purpose and fulfill the destiny that awaits him.</p>\n<br> <br>\n</div>"
    }
]